import numpy as np 
import random
import math
#1.平均值
# b=0
# z=0
# f=0
# s=0
# a = ['1','2','-1','3','','']
# while True:
#     i = str(input('Enter an integer , the input ends if it is 0:'))
#     if i == '0':
#         break
#     else:
#         a[b] = a[b] + i
#         s = s+int(i)
#     if int(i)>0:
#         z += 1
#     else:
#         f += 1
#     b+=1
# p=s/b
# print('正数有'+str(z)+'个，负数有'+str(f)+'个,和为'+str(s)+',平均值为'+str(p))
#######################################################################################################
#2.未来学费
# ncc=10000
# interest=0.05
# i=1
# scc=0
# for i in range(1,11):
#     scc = scc+ncc
#     ncc = ncc+float(ncc)*interest
# print('ten year ago cc and sc: %.2f  %.2f' %(ncc,scc) )
#######################################################################################################
#3.同时可被5和6整除的数
# l1 = []
# for i in range(100,1001):
#     if i%5==0 and i%6==0:
#         l1.append(i)
# c = 0
# for u in l1:
#     print(u,end=' ')
#     c +=1
#     if c%10==0:
#         print(end='\n')
#######################################################################################################
#5.找数
# l1 = []
# while True:
#     n = int(input())
#     if n*n>12000:
#         l1.append(n)
#     else:
#         break
# print(min(l1))
# while True:
#     n = int(input('>>'))
#     if n*n*n<12000:
#         l1.append(n)
#     else:
#         break
# print(max(l1))
#######################################################################################################
#7.消除错误
# s= 0
# for i in range(1,50001):
#     s= s+(1/i)
# print(s)
# for i in range(50000,0,-1):
#     s= s+(1/i)
# print(s)
#######################################################################################################
#8.数列求和
# l1=[]
# l2=[]
# l3=[]
# for i in range(1,98,2):
#     l1.append(i)
# for u in range(3,100,2):
#     l2.append(u)
# l3 = (np.array(l1))*(1/np.array(l2))
# print(sum(l3))
########################################################################################################
#9.计算π
# i= int(input('>>'))
# a = [] 
# for b in range(1,i):
#     c= (((-1)**(b+1))/((2*b)-1))
#     a.append(c)
# pi = 4*(sum(a))
# if i%10000==0:
#     print(pi)
########################################################################################################
#10.完全数
# l1=[]
# a=0
# for i in range(1,10000):
#     a = a+1
#     for b in range(1,a):
#         if a%b==0:
#             l1.append(b)
#     if a<10000 and a == int(sum(l1)):
#         print(a)
#     l1=[]
#######################################################################################################
#11.组合
# n=0
# for a in range(1,8):
#     for b in range(1,8):
#         print(a,b)
#         if a!=b :
#             n+=1
# print('The total number of all combinations is %d' %(n/2))
#######################################################################################################

        

